[
    {
        "Rules Version":2024,
        "Base Spell":"Charm Person",
        "Spell Level":"1st",
        "Spell Name":"Arm Person",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Choose a humanoid within range. Whatever weapon is closest to the humanoid immediately flies towards them. If the weapon is currently held or wielded by another, they must make a Constitution saving throw against your spell save DC or let go of the weapon. \n\n The target of this spell can choose to use their reaction to grab the weapon. If they do not have a reaction or a free hand available they must make a Dexterity saving throw or take damage equal to the amount of damage the weapon deals.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Jump",
        "Spell Level":"1st",
        "Spell Name":"Clump",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You select any number of non-living medium or small objects that can fit in a 10 by 10 foot cube and clump them together. You can arrange the clump into any shape that can fit inside this 10 foot by 10 foot cube. The clump acts as full cover, but can be designed to have spaces to allow line of sight through it. \n\n The clump of objects cannot be destroyed until the spell ends unless hit by a Disintegrate spell. Once the spell ends unless it is constructed in such a way that it is structurally sound and is built with objects that can hold their shape the clump falls apart.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Disguise Self",
        "Spell Level":"1st",
        "Spell Name":"Disguise Elf",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You use disguising magic to do one of the following:\n\n(1) Choose a target elf type creature. You make their clothing, armor, weapons, and other belongings look different until the spell ends or until you use your action to dismiss it. They can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change their body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. \n\n(2) Choose a target non-elf type creature. You make them look like an elf of any variety. You make their clothing, armor, weapons, and other belongings look different until the spell ends or until you use your action to dismiss it.\n\n The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.\n\n To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Frost Fingers",
        "Spell Level":"1st",
        "Spell Name":"Frosting Fingers",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Sweet buttery frosting erupts from your fingers dousing creatures in a 15 foot cone. Each creature in that area must make a Dexterity saving throw equal to your Spell Save DC. On a failure the creature is blinded and falls prone. A can attempt the save at the end of their next turn, ending both conditions on a success.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Hideous Laughter",
        "Spell Level":"1st",
        "Spell Name":"Hideous After",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You cast transmutation magic that triggers after a certain trigger occurs. Select a creature within range and an action that will trigger the spell. When the trigger is completed the creature's appearance is altered by illusion magic, making them unbelievably hideous. \n\n Any creature that can see the target and wishes to make a melee weapon attack against them must make a Wisdom saving throw against your spell save DC or become frightened. They can attempt the save again at the end of their next turn, ending the frightened condition on a success. Once a creature succeeds on this save the target of this spell can no longer frighten them with the spell's effect.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Mage Armor",
        "Spell Level":"1st",
        "Spell Name":"Rage Armor",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"8 hours",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You touch a willing creature who isn't wearing armor, and a protective magical force triggered by violence and rage surrounds it until the spell ends. The target's base AC becomes 13 + its Strength modifier whenever it deals damage to a creature. This enhanced magical protection lasts until the start of their next turn.\n\n The spell ends if you dismiss the spell as an action, or if they fail to deal damage to another creature during their turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Burning Hands",
        "Spell Level":"1st",
        "Spell Name":"Slapping Hands",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a storm of spectral slapping hands.  Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 bludgeoning damage on a failed save, or half as much damage on a successful one.\n\n The hands push any medium sized or smaller objects in the area that aren't being worn or carried.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d6 for each spell slot level above 1.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Silvery Barbs",
        "Spell Level":"1st",
        "Spell Name":"Slippery Barbs",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You create a 10 foot area covered in gummy squishy barbs. Though they look sharp they are actually incredibly slippery. Any creature entering or leaving the area for the first time must make a Dexterity saving throw. On a failure they slide up to 20 feet in a straight line in the direction they were most recently moving, take 1d8 bludgeoning damage and fall prone. On a success they  slide up to 20 feet in a straight line in the direction they were most recently moving but do not fall prone.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Thunderwave",
        "Spell Level":"1st",
        "Spell Name":"Thunderpave",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You move forward up to 30 feet in a straight line paving the ground 5 feet around you with concrete or cobblestone. The paving temporarily clears away any difficult terrain as you walk, allowing you or creatures stepping on the path to ignore magical or non-magical effects that create difficult terrain. The magical path supresses effects that create difficult terrain for up to 1 minute after casting the spell, then fades allowing the area to be affected by effects that create difficult terrain once again.\n\n Any creatures you move past within 5 feet of you must make a Dexterity save equal to your Spell Save DC or become immobilized. They can attempt the save at the end of their next turn, ending the effect on a success.\n\n Any creatures you pass within 10 feet must also make a Constitution saving throw equal to your Spell Save DC or take 1d8 bludgeoning damage from conjured flying stone and cement rushing past them to create the path.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Magic Missile",
        "Spell Level":"1st",
        "Spell Name":"Tragic Missile",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create three glowing darts of magical force. The darts deal an additional 1d4 damage if the target is a child or an adorable animal and must target one if it is within line of sight.\n\n Unless children or adorable animals are present each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several. If children or adorable animals are present you can direct them to hit one child, one adorable animal or several.\n\nUsing a Higher-Level Spell Slot. The spell creates one more dart for each spell slot level above 1.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Shield",
        "Spell Level":"1st",
        "Spell Name":"Yield",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You magically undermine an adjacent creature’s defenses. As a reaction, when a creature within 30 ft of you makes a saving throw you can force the creature to roll with disadvantage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Detect Thoughts",
        "Spell Level":"2nd",
        "Spell Name":"Deprecating Thoughts",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"You cause a creature to be overwhelmed by invasive self-loathing thoughts.\n\n The target must make a Wisdom Saving throw. On a failure they take 3d6 psychic damage, and after failing their next skill check or attack roll have disadvantage on the next skill check or attack roll it makes. On a success they only take half the damage and resist the negative thoughts.\n\n The creature can attempt the Wisdom Save again at the end of its turn, ending the effects of the spell on a success.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Aganazzar’s Scorcher",
        "Spell Level":"2nd",
        "Spell Name":"Flabbergahst’s Soaker",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":"30 ft. Line",
        "Description":" A line of gushing water 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 bludgeoning damage on a failed save and is knocked prone, or half as much damage on a successful one. They are also completely soaked.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d8 for each spell slot level above 2.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Snilloc’s Snowball Swarm",
        "Spell Level":"2nd",
        "Spell Name":"Flabberghasts’s Snail Storm",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":"60 ft.",
        "Description":" Until the spell ends, snails and snail slime fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured.\n\nThe ground in the area is covered with snails, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone due to a mixture of crushed snails and snail slime.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Acid Arrow",
        "Spell Level":"2nd",
        "Spell Name":"Flacid Arrow",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":"120 ft.",
        "Description":" You target a creature's non-magical ammunition, weakening it and causing it to bend limply. The ammunition becomes unusable for ranged attacks, but can be used an improvised weapon to deal 1d4 bludgeoning damage.\n\n You can only target one target’s ammunition and only ammunition of one weapon type at a time (e.g. longbow, shortbow, crossbow etc.)\n\nUsing a Higher-Level Spell Slot. When you cast this spell using a spell slot of 3rd level or higher, you can target an additional set  of ammunition (e.g. a second type of ammo in a targets inventory or another targets ammunition) for each slot level above 2nd.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Levitate",
        "Spell Level":"2nd",
        "Spell Name":"Imitate",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":"Self",
        "Description":" As a reaction choose a creature within line of sight and within range that has taken an action this turn. You perform the same action directly after them, as long as you can physically do so.\n\n If the target casted a spell, you can imitate it as long as you have the proper spell slot available.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Invisibility",
        "Spell Level":"2nd",
        "Spell Name":"Instability",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":"60 ft.",
        "Description":"An area within a 20 ft by 20 ft cube becomes unstable. The ground becomes difficult terrain, and if the area is on a raised or elevated floor creatures walking on the service must make a Dexterity save or fall to the lower floor and become prone.\n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Invisibility",
        "Spell Level":"2nd",
        "Spell Name":"Invisalign",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":"60 ft.",
        "Description":" You conjure a clear intentionally uncomfortable invisalign retainer that latches onto a creature's teeth. The creature must make a Constitution Saving throw. On a success they ignore the effects of the spell.\n\n A creature that fails deals no damage with bite attacks, takes 1d10 bludgeoning at the start of their turns, has disadvantage on concentration checks and has disadvantage on Wisdom saving throws due to the distracting throbbing pain.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Blur",
        "Spell Level":"2nd",
        "Spell Name":"Lure",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":"10 ft.",
        "Description":" A light appears up tp 10 ft in front of you, with a soft beguiling glow for up to 1 minute. \n\n All creatures you choose that can see the light must make a Wisdom save against your spell save DC. On a failure they feel compelled to grab the lure, and must use their move and action to dash towards it on their turn. The first creature that was compelled to grab the lure is wrapped in glowing light and is restrained until the spell ends. They can attempt to escape the luminious bonds at the end of their turn by succeeding on a Strength check versus you spell save DC. Alternatively if the creature can teleport via a spell or ability it can leave the bonds that way instead.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Mirror Image",
        "Spell Level":"2nd",
        "Spell Name":"Mirror Mage",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a mirror duplicates of yourself wearing old-timey wizard clothes. The duplicate looks exactly like you. When attacked the attacking creature must roll a 1d20, and on an 11 or higher they strike the illusory duplicate.\n\n When you cast a cantrip the mirror mage also casts the same cantrip, causing the cantrip to be cast twice against the same target. Any cantrip cast by the mirror mage deals only half damage and targets have advantage on any the saving throws the spell forces them to make.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Pyrotechnics",
        "Spell Level":"2nd",
        "Spell Name":"Pyrokenisis",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose a open flame within range and in line of site. You can control that flame for the duration of the spell, and can increase or decrease its brightness, alter its color, and\/or snuff out the flame.\n\n As a bonus action you can move the fire from its current location to a new one up to 30 feet away, forcing creatures the fire moves through to make Dexterity saving throw against your spell save DC or take 3d8 fire damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Thunder Step",
        "Spell Level":"3rd",
        "Spell Name":"Blunder Step",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":"30 ft",
        "Description":" You begin to teleport yourself to an unoccupied space you can see within 60 ft. Instead you stumble and fall, rolling and bouncing with increasing speed to the location propelled by the magic. If you are unable to continue rolling because of a barrier you stop at the barrier.\n\n For every 10 feet you travel you take 1d4 bludgeoning damage. Any creatures of your size or smaller you roll into must also make a Dexterity saving throw against your spell save DC. On a failure they take 1d6 damage for every 10 ft you have travelled and are knocked prone. If the creature is smaller than you they have disadvantage on the save. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Catnap",
        "Spell Level":"3rd",
        "Spell Name":"Catnip",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a sprig of energizing catnip. Your movement speed increases by 10 feet, you gain 1d10 temporary HP, and you gain advantage on Dexterity saving throws. \r\n\r\n In addition, when you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\r\n\r\n As soon as the spell ends you gain one level of exhaustion.\r\n \r\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the temporary HP received increases by 1d8 for each slot level above 3rd.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Hold Monster",
        "Spell Level":"3rd",
        "Spell Name":"Cold Monsters",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You summon a swarm of spirits who lives in an arctic environment at a point of your choosing you can see within range.\n\n You and your allies have Advantage on Constitution saving throws and resistance to cold damage while you’re within 5 feet of the spirits, and when you move on your turn, you can also move the spirits up to 30 feet to an unoccupied space you can see.\n\n Whenever the spirits move within 10 feet of a creature you can see and whenever a creature you can see enters a space within 10 feet of the spirits or ends its turn there, you can force that creature to make a Dexterity saving throw. On a failed save, the creature takes 3d10 Cold damage. A creature makes this save only once per turn.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d10 for each spell slot level above 5.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Counterspell",
        "Spell Level":"3rd",
        "Spell Name":"Countersill",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a countersill between an enemy and their target. \n\n If a spellcaster is making a ranged spell attack the target counts as having half cover. If a spell forces the target to make a Dexterity saving throw they have advantage on the roll.\n\n If a melee attack is being made against the target the target counts as having half cover. if a ranged attack is being made against the target the target counts as having half cover.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Fly",
        "Spell Level":"3rd",
        "Spell Name":"Fall",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"  You target a creature flying or hovering in the air. They must make a Constitution saving throw against your spell save DC.  On a failure the target immediately falls to the ground. On a success their flying speed is halved until the end of their next turn as they resist your magic.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Haste",
        "Spell Level":"3rd",
        "Spell Name":"Mace",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"24 hours",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a bottle of magical mace. You can choose to hold on to and spray the mace at any time within 24 hours, after which the bottle dissipates. When you do use it you create a 15 foot cone of blinding aerosol in front of you and then the bottle also dissipates. \n\n Any creature must make a Dexterity saving throw. On a failure they are blinded until they wash their eyes out or spend an hour recovering, and take 3d8 fire damage. On a  success they are blinded for 1 minute and take half damage. A lesser restoration spell or dispel magic can also remove the blinded condition caused by this spell.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Dispel Magic",
        "Spell Level":"3rd",
        "Spell Name":"Repel Magic",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a magical force that repels magical items, magically summoned creatures or creatures affecetd by magical effects in a 20 ft radius sphere centered on yourself. \n\n All magical items not worn or carried, all incapacitated magical creatures, and all inactive magical constructs are repelled. They move until they reach the end of the spell's range, or if a barrier stops their movement.\n\n A creature that is wielding a magic item must make a Strength saving throw. On a failure they must either drop the item if possible and have it pushed the end of the spell's range, or be pushed with it and be knocked prone. The item or the creature with the item move until they reach the end of the spell's range, or if a barrier stops their movement. On a success they do not move. \n\n A creature affected by or summoned by a spell or magical effect must make a Strength saving throw. The item or the creature with the item move until they reach the end of the spell's range, or if a barrier stops their movement. On a failure they are pushed to the edge of the spell's range, and are knocked prone. On a success they do not move.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Stinking Cloud",
        "Spell Level":"3rd",
        "Spell Name":"Shrinking Cloud",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a 20-foot-radius sphere of glittery blue gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.\n\n Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw. On a failed save, the creature and all equipment it is carrying is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category--from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target's weapons also shrink to match its new size. While these weapons are reduced, the target's attacks with them deal 1d4 less damage (this can't reduce the damage below 1).\n\n A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Sleet Storm",
        "Spell Level":"3rd",
        "Spell Name":"Slow Storm",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Until the spell ends, a vicious slow storm of hail and lightning rages in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are slowly doused. The storm is vicious but occurring in slow motion. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw with advantage. On a failed save the creature takes 6d6 bludgeoning damage and 3d10 lightning damage.\n\n If a creature starts its turn in the spell's area and is concentrating on a spell, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration. They have advantage on the save.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Blink",
        "Spell Level":"3rd",
        "Spell Name":"Stink",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a cloud of invisible vitriolic stench in a 20 foot radius sphere. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell.\n\n When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Constitution saving throw. On a failure they are poisoned, and cannot attempt to remove the condition with a Constitution saving throw until they leave the affected area.\n\nThe stench moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Slow",
        "Spell Level":"3rd",
        "Spell Name":"Swallow",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Your jaw distends unnaturally and you attempt to swallow a creature your size or smaller. \n\n If the creature is the same size as you, make a melee spell attack against the target. On a success you partially swallow the target,  grappling the creature and restraining it. At the start of their turns they take 6d6 acid damage. At the end of their turns they can attempt a Strength saving throw against your spell save DC to escape. \n\n If the creature is smaller than you, make a melee spell attack against the target. On a success the creature is swallowed completely and is restrained. At the start of their turns they take 12d6 acid damage. When a creature deals damage to you you must make a concentration check. On a failure your body vomits out the swallowed creature.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Wall of Water",
        "Spell Level":"3rd",
        "Spell Name":"Whale of Water",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You summon an elemental spirit in the form of a whale. It manifests in an unoccupied space that you can see within range and uses the Elemental Spirit stat block, but is a huge creature instead of a medium creature and uses the Water element features specifically.\n\nThe creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its movement to avoid danger.\n\nUsing a Higher-Level Spell Slot. Use the spell slot’s level for the spell’s level in the stat block.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Control Water",
        "Spell Level":"4th",
        "Spell Name":"Control Wicker",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"Until the spell ends, you animate and control any wicker inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. For the purposes of this spell wicker includes any object made of woven plant material such as willow, reed, bamboo, etc. or raw material that can be used to make wicker. Animated or crafted objects made of wicker always have vulnerability to fire damage and are resistant to bludgeoning damage.\n\n As an action on your turn, you can repeat the same effect or choose a different one.\n\n Grow. You cause the plant matter used to create wicker objects to grow as if it was a living plant. You can make the wicker grow and fill the ground of the area of the cube, making it difficult terrain for the duration of the spell.\n\n Entangle. You can cause the plant matter used to create wicker objects to lash put and entangle nearby creatures. For each wicker object affected by the spell make a melee spell attack against the closest hostile creature within 15 feet of the object. If the object is larger then the creature targeted by this ability \n\n Rearrange. You can make all wicker objects in the area move into an arrangement or shape of your choice. They can be piled up to create cover, walls, or to surround other objects or creatures.  \n\nWeave. You can weave raw plant material in the area into 1 gargantuan wicker object, 2 huge wicker objects, 4 large wicker objects, 8 medium wicker objects, or 16 small wicker objects. They are all of immaculate quality.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Dimension Door",
        "Spell Level":"4th",
        "Spell Name":"Dimension Sore",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You rip open a portal in reality that oozes blood, pus and ichor while screaming and connecting two locations within range. \n\n Any creature can use the portal to appear at another location you choose. The location the portal connects too must be a place you can see, one you can visualize, or one you can describe by stating distance and direction.\n\n The portal stays open until the end of your next turn, and spells or attacks can be made through it. Passing through the portal requires a Constitution saving throw. On a failure the portal itself rips at the creature moving through it with its maddening impossible teeth and they take 3d8 piercing damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Charm Monster",
        "Spell Level":"4th",
        "Spell Name":"Farm Monster",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You target one creature within range. If it is a Beast type creature, Plant type creature, or a humanoid that looks like either of those types of creatures, it  must make a Wisdom saving throw. If it fails it is charmed by you until the spell ends or until you or your companions do anything harmful to it.\n\n While charmed the creature can immediately produce eggs, milk, fruits, seeds, or nuts  if it can biologically do so whenever you order it to do so.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Raulothim’s Psychic Lance",
        "Spell Level":"4th",
        "Spell Name":"Flabberghast’s Psychic Pants",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You conjure a pair of stylish jeans that grant you powerful psychic boons for the duration of the spell. These include the following:\n\nTelepathy. While wearing the pants you can speak telepathically with any creature you can see. The creature can respond to you telepathically. \n\nDetect Thoughts. For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected. You initially learn the surface thoughts of the creature—what is most on its mind in that moment.\n\n  As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Due to the power of the pants a creature is unaware of any attempts to probe deeper into their mind.\n\n Psychic Resistance. While wearing the pants you gain resistance to Psychic damage and advantage on Wisdom saving throws.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Fire Shield",
        "Spell Level":"4th",
        "Spell Name":"Fur Shield",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Bushy thick fur covers your body for the duration. You can end the spell early by using an action to dismiss it.\n\n The fur grants resistance to cold, non-magical slashing,  non-magical piercing and non-magical bludgeoning damage but it covers your eyes and ears giving you disadvantage on Perception checks.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Greater Invisibility",
        "Spell Level":"4th",
        "Spell Name":"Greater Instability",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" An area within a 20 ft by 20 ft cube becomes unstable physically and emotionally. The ground becomes difficult terrain, and if the area is on a raised or elevated floor creatures walking on the service must make a Dexterity save or fall to the lower floor and become prone. \n\n In addition all creatures in the area must make a Wisdom save, On a failure they are overcome by intense emotion and begin to cry uncontrollably. Until they leave the affected area they have disadvantage on attack rolls, skill checks and Wisdom saving throws.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Ice Storm",
        "Spell Level":"4th",
        "Spell Name":"Rice Storm",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"A hail of nutritious cooked rice falls to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range.\n\n The rice is harmless, and in fact infused with nutritional magic. If a creature spends an action they can collect a handful and eat it, regaining 8d4+8 hitpoints. The healing powers of the rice fade after 10 minutes.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Stoneskin",
        "Spell Level":"4th",
        "Spell Name":"Stonerskin",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You become incredibly high, dulling pain while reducing your reaction time. \n\n As long as the spell is active you have resistance to all nonmagical damage except psychic, but your speed is reduced by half and you can no longer take reactions. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Summon Construct",
        "Spell Level":"4th",
        "Spell Name":"Summon Abstraction",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You summon a living abstract concept from the realms of emotion, ideas and principles. It manifests in an unoccupied space that you can see within range and uses the Construct Spirit stat block. Select one of the following options granting the Abstraction additional unique abilities:\n\nMathematical. Gains the Probability Manipulation ability, granting any friendly creature within 10 ft of the abstraction the ability to add a d6 to rolls they make.\n\nEmotional. Grants the Emotional Manipulation ability, which makes the Abstraction’s attacks deal psychic damage and ignore all resistances.\n\nChronological. Grants the Time Stutter ability, which causes any creature struck by the Abstraction to lose the ability to use Bonus Actions or Reactions until the start of the Abstractions next turn.\n\nLinguistic. Grants the Somatic Amplification ability, which causes all friendly creatures within 10 feet of the Abstraction to gain advantage on Charisma checks and on spell attacks using somatic components.\n\nValue. Grants the Appreciate Value ability, which causes passive bonuses from all magic items attuned by friendly creatures within 10 feet to be doubled.\n\nUsing a Higher-Level Spell Slot. Use the spell slot’s level for the spell’s level in the stat block.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Blight ",
        "Spell Level":"4th",
        "Spell Name":"Tight",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You tighten knots, clothing, bindings or other such objects. If they are worn by or binding a creature the creature must make a Constitution saving throw against your spell save DC. On a failure they become immobilized and take 3d10 bludgeoning damage. On a success they take half damage, their speed is reduced by half and they have disadvantage on attack rolls, saving throws and ability checks.\n\n The creature takes an additional 3d10 damage at the start of its turn and if it ever takes the move action. If the creature can escape, and\/or destroy the object affected by the spell its effects end. If it can alter its form so the affected object merges with their body the effect ends. \n\n If targeting an object that isn’t worn or carried you strengthen it and compress it to make it more tight. Add your spellcasting modifier to DC of the skill check required to interact with the object.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Wall of Fire",
        "Spell Level":"4th",
        "Spell Name":"Wall of Ire",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"A wall of illusory yelling and angry faces springs up on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is translucent and lasts for the duration.\n\n When the wall appears, each creature within its area must make a Constitution saving throw. On a failure they are pushed put of the area, take 5d8 psychic damage and fall prone. On a success they are pushed out of the area, and take half damage but don’t fall prone. \n\n If a creature ever makes an attack that passes through the wall, or attacks the wall itself they must make a Wisdom save or take 5d8 psychic damage. If a creature ever tries to walk through the wall they also must make a Wisdom save or take 5d8 psychic damage and be knocked prone.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Cloudkill",
        "Spell Level":"5th",
        "Spell Name":"Cloud-o-krill",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a 20-foot-radius sphere of magical krill that fly in the air centered on a point you choose within range. The krill spread around corners. Its area is heavily obscured.\n\n The krill follow your orders, and block melee, ranged, and spell attacks made at creatures behind them. They have a fly speed of 30 feet, and AC of 8, and 40 hitpoints. \n\n Though the krill cannot harm creatures larger than themselves the sheer mass of them allows them to push creatures the swarm moves into. Any creature the cloud of krill moves through that is Medium size or smaller must make a Strength Saving throw to resist the swarm. On a failure they move with the swarm to the location it is moving to and are knocked prone. If that location is in the air the creature falls after the krill finishes their move.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2014,
        "Base Spell":"Hold Monster",
        "Spell Level":"5th",
        "Spell Name":"Cold Monsters",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"You summon a random creature from the monster manual who lives in an arctic environment at a point of your choosing you can see within range. Roll 1d8 and consult the table below. The creatures follow your orders to the best of their ability. The creatures gain resistance to cold damage if they do not already have that feature.\n\n1 - 8 x Seal (CR 0)\n2 - 4 x Elk (CR ¼)\n3 - 4 x Giant Goat (CR ½)\n4 - 2 x Winter Dire Wolf (CR 1)\n5 - 1 x Polar Bear (CR 2)\n6 - 1 x Killer Whale (CR 3)\n7 - 1 x Giant Walrus (CR 4)\n8 - 1 x Mammoth (CR 5)\n\nUsing a Higher-Level Spell Slot. Roll an additional 1d8 for each spell slot level above 5 and choose one of the results.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Cone of Cold",
        "Spell Level":"5th",
        "Spell Name":"Cone of Mold",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Creeping thick black mold erupts from your hands and grows outwards in a cone. Each creature in a 60-foot cone must make a Constitution saving throw. A creature takes 8d8 poison damage on a failed save and becomes poisoned, or half as much damage on a successful one. A creature can attempt the save again at the end of their turns, ending the poisoned condition on a success.\n\n A creature killed by this spell rots immediately and cannot be resurrected without the use of a true resurrection spell.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d8 for each spell slot level above 5.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Scrying",
        "Spell Level":"5th",
        "Spell Name":"Crying",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You invade a creature’s mind forcing them to watch illusory images of moments that they find incredibly sad. \n\n The creature must make a Wisdom saving throw. On a failure they take 8d8 non-lethal psychic damage and burst into uncontrollable sobbing. While crying they have disadvantage on attack rolls and skill checks. On a success they take half damage instead and do not burst into tears.\n\n At the end of their turns they can attempt the saving throw again, ending the effects of the spell on a success.\n\n This spell has no effect on undead, constructs, or incredibly privileged people because not enough sad memories can be accessed.",
        "Unnamed: 10":"Increase Level?"
    },
    {
        "Rules Version":2024,
        "Base Spell":"Far Step",
        "Spell Level":"5th",
        "Spell Name":"Fury Step",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Your steps imbue you with righteous fury. The next time you take the move action on your turn your next successful attack deals additional 6d10 force damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Mislead",
        "Spell Level":"5th",
        "Spell Name":"Misfeed",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You select a creature within range. The creature must make a Constitution save. The creature has disadvantage if they are a Beast type creature and immediately fails the save if they are a pet. \n\n The creature immediately becomes overweight. Their weight immediately doubles, their speed is reduced by half, and any melee attacks or skill checks using Dexterity are made at disadvantage.\n\n Any opposed Strength checks are made at advantage by the creature, but after doing so they automatically gain one level of exhaustion.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Passwall",
        "Spell Level":"5th",
        "Spell Name":"Pisswall",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a wall of piss on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall’s space is difficult terrain.\n\n Any ranged weapon attack that enters the wall’s space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot-square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall’s piss doesn’t fill it.\n\n The smell is acrid and pungent, any creature within 10 feet of the wall of piss must make a Constitution saving throw or become affected by the poisoned condition. They can attempt the save again at the end of their turn, ending the condition on a success. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Immolation",
        "Spell Level":"5th",
        "Spell Name":"Starvation",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You drain the calories from a creature, causing them to wither and starve.\n\n The target must make a Constitution saving throw. It takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one. On a failed save, the target also gains one level of exhaustion. \n\n At the end of each of its turns, the target repeats the saving throw. It takes 4d6 necrotic damage on a failed save, and the spell ends on a successful one. This magical hunger can’t be ended by eating food.\n\n If damage from this spell kills a target, the target is turned to a desiccated pile of bones and skin.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Steel Wind Strike",
        "Spell Level":"5th",
        "Spell Name":"Stinky Wind Strike",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You disappear with a massive fart and then disappear, moving swiftly and leaving a deadly stinky breeze as you go. Any creatures within 5 feet of you must make a Constitution saving throw. On a failure they take 3d10 poison damage and must move away from your initial starting point at the start of their next turn. On a success they take half damage and do not have to flee.\n\n Choose up to five creatures you can see within range. Make a melee spell attack against each target. On a hit, a target takes 3d10 force damage.\n\n You then appear in an unoccupied space you can see within 5 feet of one of the targets you hit or missed.\n\n After appearing you must draw a connected line between your start point and end point. The line must pass each target you attempted to strike with the spell. Those creatures and any creatures who pass through this line of horrible stench must make a Constitution saving throw. On a failure they take 3d10 poison damage and must use their movement to move away from at the start of their next turn, or the rest of their movement if they are moving through the line on their turn.\n \nThe smell dissipates at the start of your next turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Circle of Death",
        "Spell Level":"6th",
        "Spell Name":"Circle of Math",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a 60 foot sphere, cube or triangle where mathematical rules are manipulated. \n\n As a reaction, when a creature in the area rolls a die you can roll a d4. You may add to, subtract from, multiply or divide any number used in the calculation to determine success or failure. This spell cannot be used to alter the number rolled on any dice.\n\n Your mathematical alterations and bonuses cannot bring the value of a roll above the highest possible amount that could be rolled. If they do, the final value caps at the maximum possible value. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Disintegrate",
        "Spell Level":"6th",
        "Spell Name":"Dysentery",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You give someone incredibly violent and bloody diarrhea.\n\n Choose a creature within range you can see. They must make a Constitution saving throw. On a failed save, the target takes 10d6 + 40 poison damage. The target dies immediately from sudden extreme blood and water loss if this damage leaves it with 0 hit points. \n\n This spell has no effects on constructs, undead, or plants.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Eyebite",
        "Spell Level":"6th",
        "Spell Name":"Eyesight",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Either you or a creature you touch immediately gains Blindsight, Darkvision, Truesight, and X-Ray vision with an effective maximum range equal to your current vision. If the target of the spell is permenantly blind or suffering from the blinded condition they are no longer blinded even after the spell ends.\n\n Only one type of vision can be active at a time, and it takes a bonus action to swap between them. You can control the range you can see using a particular type of vision at will to focus on particular things.\n\n You also gain the following passive benefits:\n\n(1) You have advantage on Perception checks.\n(2) You are immune to effects that would cause blindness.\n(3) You gain the ability to see objects up to 100 feet away with incredible detail.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Globe of Invulnerability",
        "Spell Level":"6th",
        "Spell Name":"Gobble of Invulnerability",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You transform into a turkey invulnerable to spells of 5th level or lower. Even if the spell is cast using a higher level spell slot you are invulnerable to it. \n\n While a turkey you can speak normally, and cast spells as long as they do not require somatic components. You can choose whether your gear merges with your body or drops to the ground where you are standing. \n\n Your melee attacks are replaced with beak attacks, which count as melee spell attacks, and deal 1d4 + your spellcasting ability modifier piercing damage.\n\n You can end the spell early as a bonus action.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Investiture of Flame",
        "Spell Level":"6th",
        "Spell Name":"Investment of Flame",
        "Components":"Gold Pieces",
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" \nChoose an amount of gold in your inventory to invest in the spell. The maximum amount you can invest is equal to twice your spellcasting ability modifier. \n\n Roll a d4. The number rolled is the investment number and the number of rounds it takes for the spell to take effect. Add the investment number rolled to the value of [gold spent] when calculating the spells effects. When calculating [gold spent] round up (e.g. 2.5 gold to 3 gold). When calculating [gold spent] to determine the range or radius of effects round up (e.g. round up 2 ft to 5 ft and 8 ft to 10 ft).\n\n Flames race across your body, shedding bright light in a [five times gold spent]-foot radius and dim light for an additional [five times gold spent] feet for the spell’s duration. The flames don’t harm you. Until the spell ends, you gain the following benefits:\n\n You are immune to fire damage and have resistance to cold damage.\n\n Any creature that moves within [three times gold spent] feet of you for the first time on their turn or ends its turn there takes [investment number]d10 fire damage.\n\n You can use your action to create a line of fire [three times gold spent] feet long and [half gold spent] feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes [half gold spent + investment number]d8 fire damage on a failed save, or half as much damage on a successful one.\n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Investiture of Ice",
        "Spell Level":"6th",
        "Spell Name":"Investment of Ice",
        "Components":"Gold Pieces",
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose an amount of gold in your inventory to invest in the spell. The maximum amount you can invest is equal to twice your spellcasting ability modifier. \n\n Roll a d4. The number rolled is the investment number and the number of rounds it takes for the spell to take effect. Add the investment number rolled to the value of [gold spent] when calculating the spells effects. When calculating [gold spent] round up (e.g. 2.5 gold to 3 gold). When calculating [gold spent] to determine the range or radius of effects round up (e.g. round up 2 ft to 5 ft and 8 ft to 10 ft).\n\n Until the spell ends, ice rimes your body, and you gain the following benefits:\n\n You are immune to cold damage and have resistance to fire damage.\n\n You can move across difficult terrain created by ice or snow without spending extra movement.\n\n The ground in a [three times gold spent]-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.\n\n You can use your action to create a [three times gold spent]-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes [half gold spent + investment number]d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed reduced by [three times gold spent] feet until the start of your next turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Investiture of Stone",
        "Spell Level":"6th",
        "Spell Name":"Investment of Stone",
        "Components":"Gold Pieces",
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose an amount of gold in your inventory to invest in the spell. The maximum amount you can invest is equal to twice your spellcasting ability modifier. \n\n Roll a d4. The number rolled is the investment number and the number of rounds it takes for the spell to take effect. Add the investment number rolled to the value of [gold spent] when calculating the spells effects. When calculating [gold spent] round up (e.g. 2.5 gold to 3 gold). When calculating [gold spent] to determine the range or radius of effects round up (e.g. round up 2 ft to 5 ft and 8 ft to 10 ft).\n\n Until the spell ends, bits of rock spread across your body, and you gain the following benefits:\n\n You have resistance to bludgeoning, piercing, and slashing damage from non magical attacks.\n\n You can use your action to create a small earthquake on the ground in a [three times gold spent]-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone. \n\n As a bonus action you can alter earth, stone or rock you can see to make difficult terrain and trap enemies. Choose a point within [three times gold spent + investment number] ft of you. An area equal to [two times gold spent + investment number] centered on that point becomes difficult terrain. All creatures in the area must make a Dexterity saving throw or take [gold spent + investment number]d8 bludgeoning damage and become immobilized. Immobilized creatures can attempt a Strength (Athletics) check or Dexterity (Acrobatics) to escape at the end of their next turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Hold Monster",
        "Spell Level":"6th",
        "Spell Name":"Scold Monster",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" \nAs a reaction you admonish a creature for its bad behavior. The target must make a Wisdom saving throw. On a failure, the target takes 8d8 psychic damage, and has disadvantage on attacks, skill checks and saving throws while they can see you. On a success they take half damage.\n\n At the end of their turn they can make the Wisdom save again, ending the negative effects on a success. \n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Scatter",
        "Spell Level":"6th",
        "Spell Name":"Splatter",
        "Components":"Unsealed Liquid",
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Choose any unsealed liquid within line of sight. The liquid splatters its contents in all directions around it. This spell can target magical liquids or conjured liquids created by spells. \n\n If the liquid is dangerous to the touch all creatures within 5 feet of the liquid must make a Dexterity saving throw. On a failure they take 8d6 damage of the damage type the liquid would deal. On a success they take half damage.\n\n If the liquid heals or provides a buff to creatures all creatures within 5 feet of it gain the benefits of the liquid, even if creatures must normally drink it to gain its effects.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Wall of Ice",
        "Spell Level":"6th",
        "Spell Name":"Wall of Spice",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a wall of psychoactive cinnamon. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.\n\n When the wall appears, each creature within its area must make a Constitution saving throw. On a failed save, a creature takes 5d8 psychic damage from mind altering visions, or half as much damage on a successful save. \n\n A creature makes the saving throw when it enters the wall for the first time on a turn or ends its turn there. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Freezing Sphere",
        "Spell Level":"6th",
        "Spell Name":"Wheezing Sphere",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conujure a sphere of shifting mouths that cough and wheeze on everything around it. The air produced by the sphere is  poisonous and can cause a creature who breathes the infected air to develop an infectious disease. \n\n Any creatures within 10 feet of the sphere must make a Constitution saving throw. On a failure they take 6d6 poison damage and on a success they take half damage. If the creature fails the check by 5 or more they also develop a random infectious disease.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d6 for each spell slot level above 5.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":null,
        "Spell Level":"6th",
        "Spell Name":null,
        "Components":"Gold Pieces",
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose an amount of gold in your inventory to invest in the spell. The maximum amount you can invest is equal to twice your spellcasting ability modifier. \n\n Roll a d4. The number rolled is the investment number and the number of rounds it takes for the spell to take effect. Add the investment number rolled to the value of [gold spent] when calculating the spells effects. When calculating [gold spent] round up (e.g. 2.5 gold to 3 gold). When calculating [gold spent] to determine the range or radius of effects round up (e.g. round up 2 ft to 5 ft and 8 ft to 10 ft).\n\n Ranged weapon attacks made against you have disadvantage on the attack roll.\n\n You gain a flying speed of [three times gold spent] feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.\n\n You can use your action to create a [three times gold spent]-foot cube of swirling wind centered on a point you can see within [three times gold spent] feet of you. Each creature in that area must make a Constitution saving throw. A creature takes [half gold spent + investment number]d8 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to [two times gold spent] feet away from the center of the cube and falls prone.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Crown of Stars",
        "Spell Level":"7th",
        "Spell Name":"Crown of Bars",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Seven floating metal bars appear and orbit your head until the spell ends. You can use a bonus action to send one of the bars streaking toward one creature or object within 120 feet of you. When you do so, make a ranged spell attack. On a hit, the target takes 4d12 bludgeoning damage. Whether you hit or miss, the metal bar is expended and clatters loudly to the floor. The spell ends early if you expend the last bar.\n\n If you have 4 or more bars remaining, they clang loudly together whenever you move and interrupt your vision, giving you disadvantage on Perception checks and Stealth checks.\n\nUsing a Higher-Level Spell Slot. The number of bars created increase by two for each spell slot level above 7.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Delayed Blast Fireball",
        "Spell Level":"7th",
        "Spell Name":"Delayed Past Fireball",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" A beam of yellow light flashes from your pointing finger then blossoms with a low roar into an explosion of flame 1d4 rounds in the past. \n\n Each creature that was within a 20-foot-radius sphere centered on that point at that time must make a Dexterity saving throw. A creature takes 12d6 fire damage, or half as much damage on a successful one. \n\nThe fire damages objects in the area and ignites flammable objects that aren't being worn or carried.\n\nUsing a Higher-Level Spell Slot. The damage increases by 1d6 for each spell slot level above 7.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Dream of the Blue Veil",
        "Spell Level":"7th",
        "Spell Name":"Dream of the Blue Hedgehog",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You and up to eight willing creatures are infused with the power of the blue hedgehog, granting increased speed and an aura of crackling lightning. \n\n All creatures affected by the spell immediately increase their movement speed by 30 ft. when running. All affected creatures gain an additional +2 AC, gain advantage on Dexterity saving throws, and deal an additional 2d10 lightning damage on melee attacks while the spell is active,\n\n As an action a creature affected by this spell can use their action to roll into a spinning blue ball. At the start of the creature's next turn they charge forward up to 30 feet towards a creature or object of their choice and make a melee spell attack. On a successful hit the target takes 4d10 bludgeoning damage and 4d10 lightning damage. If targeting an item or construct the bludgeoning damage is doubled.\n\n This Spinning Blue Ball attack can only be used once by each creature the spell affects.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Finger of Death",
        "Spell Level":"7th",
        "Spell Name":"Fish Finger of Death",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a fish finger imbued with the power of death. The next creature other then yourself to touch the fish finger must make a Constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one.\n\n You can attempt to wield the fish finger as a weapon and strike a creature with it. In which case roll a melee spell attack. On a hit the creature takes 7d8 + 30 necrotic damage.\n\n After dealing damage the fish finger is consumed and turns to ash. After a minute the fish finger also turns to ash.\n\n A humanoid killed by this spell rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Symbol",
        "Spell Level":"7th",
        "Spell Name":"Gimbal",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You use magic to alter the rotation of a creature you can see. \n\n As a reaction you can choose a creature you can see, altering its rotation and changing where they are facing before they take an action. \n\n You can rotate the creature in any direction up to 360 degrees, rotating them around the center of their mass. If changing their facing would cause them to lose line of sight to their initial target they can attempt to target a new creature within line of sight but at disadvantage. If there is no valid target single target attacks fail. If the creature is casting a spell that specifies a point within range that point rotates with them.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Teleport",
        "Spell Level":"7th",
        "Spell Name":"Heliport",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"24 hours",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a small heliport pad and a small helicopter that can transport up to four creatures. The individual who casts the spell is able to fly the helicopter without any issues and it does not need fuel. If the pilot attempts to land the helicopter on an uneven surface or where there is something blocking their descent they and any creatures in the space they are landing must make a Dexterity saving throw. On a failure they crash dealing 8d8 bludgeoning damage to anyone in the helicopter and to any creatures in the space where it crashes. On a success they land successfully.\n\n If the heliport and helicopter are ever conjured in a space that cannot accomodate it, the area is damaged as it is altered by the magic and all creatures in the area must make a Dexterity saving throw or take 8d8 bludgeoning damage. \n\n The helicopter and helipad dissipate after 24 hours unless the spell is cast again.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Draconic Transformation ",
        "Spell Level":"7th",
        "Spell Name":"Iconic Transformation",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"You transform your body for the next minute, granting you an “iconic” ability, action, bonus action, or from a monster in the DND setting. Use the attack bonuses, saving throw DC’s and damage as written when determining the results of using one of these abilities.\n\n If an ability, attack or effect requires another ability of the creature to be used first (e.g. grappling, putting the target to sleep, etc.) the prerequisite ability is also learned. Roll 1d6 and gain one of the following options depending on the result:\n\n[1] Mimic Shape-Shifting: Your body gains the ability to alter its external and internal features to shapeshift into seemingly innocuous objects. You gain the Mimic Shape-Shift ability.\n\n[2] Pelt of the Displacer Beast: Your skin projects an illusory protective ward and you gain the Displacement ability from the Displacer Beast stat block.\n\n[3] Gelatinous Engulf: You become a large ooze-like creature and gain the Gelatinous Cube’s Engulf ability. \n\n[4] Mind Flayer Psionics: Your brain enlarges and you gain the Mind Blast ability from the Mind Flayer stat block.\n\n[5] Beholder’s Eye Stalk: An eye on a long stalk erupts from your head and you gain the Eye Rays ability from the Beholder stat block. \n\n[6] Dragons Breath: Your head transforms into a dragon’s. Choose a Young Dragon type. You gain access to the creature’s Breath Weapon attack.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Magnificent Mansion",
        "Spell Level":"7th",
        "Spell Name":"Magnificent Marmot",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"  You summon a Magnificent Marmot. The marmot is a celestial being who blesses you and allies with adorable antics and magnificent magic. Choose a 10 foot by 10 foot area you can see. That area becomes the marmot's stage.\n\n For the duration of the spell, until the marmot is attacked or until the performance is disrupted you and any allies that can see the marmot gain the following benefits:\n\n(1) If you or friendly creatures are not incapacitated they heal 3d10 hitpoints at the start of their turns\n(2) You and friendly creatures gain resistance to necrotic damage\n(3) You and freindly creatures gain +5 to all saving throws\n(4) You and friendly creatures add 1d6 to all attack rolls to hit and all skill checks",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Plane Shift",
        "Spell Level":"7th",
        "Spell Name":"Planar Gift",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" A random magic item of Rare quality appears from another plane of existence in your hand. It automatically attunes to you even if you do not have the attunement slots available, you gain proficiency with it, and it disappears after 1 minute. If the item is a set of armor it is appears on your body.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Power Word Pain",
        "Spell Level":"7th",
        "Spell Name":"Power Word Brain",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You rapidly expand the mental capacities of yourself or a willing creature you can see, unlocking telekinetic powers as you expand their brain.\n\n For the duration of the spell you gain the ability to cast the Telekinesis spell without expending a spell slot. You also gain a fly speed of 15 feet.\n\n In addition, you also gain the ability to maintain concentration on two spells at once, and as a bonus action can make a Brain Blast ranged spell attack. The Brain Blast has a range of 30 ft and deals 3d10 force damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Suburst",
        "Spell Level":"8th",
        "Spell Name":"Gumburst",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Rapidly expanding sticky chewing gum bubbles in a 60-foot radius centered on a point you choose within range. Each creature in the gum must make a Strength saving throw.\n\n On a failed save, a creature is restrained. On a success the creature is not restrained. A restrained creature has disadvantage on attempts to escape the gum unless another creature helps them out of the gum. \n\n If a creature successfully pulls itself from the gum or another creature pulls them out out of the gum they take 3d6 force damage as it rips layers of skin from their body. If they are covered in exposed fur they take 6d6 force damage instead. If the creature is wearing heavy armor escape is impossible without using a tool or weapon that deals slashing damage. \n\n After the gum has stopped expanding the area becomes difficult terrain, and cannot be traversed unless a creature succeeds at an Athletics check against your spell save DC.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Incendiary Cloud",
        "Spell Level":"8th",
        "Spell Name":"Incendiary Mound",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"A large mound of packed white ash with sticks of dynamite poking out from it appears out of the ground in a 20-foot-radius sphere centered on a point within range. \n\n If a creature walks onto the mound or moves while standing on the mound it explodes filling an area with burning hot embers. The creature on the mound and each creature within 20 feet of the mound must make a Dexterity saving throw. A creature takes 10d8 fire damage on a failed save, or half as much damage on a successful one.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Maddening Darkness",
        "Spell Level":"8th",
        "Spell Name":"Maddening Snarkiness",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose a creature within range. That creature is haunted by a snarky voice which rings out with sarcastic compliments whenever they take actions. \n\n Whenever a creature takes an action, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one. If it fails the save the target’s next action is taken with disadvantage. \n\n A creature can make the Wisdom saving throw again at the end of their next turn, ending the spell on a success, but they have disadvantage on the save if they failed to hit with an attack or failed a saving throw this turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Dominate Monster",
        "Spell Level":"8th",
        "Spell Name":"Nominate Monster",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose a creature within range and in line of sight. You increase all of its base stats and its armor class by +4. In addition,  until the spell ends their speed increases by 10 ft and they gain 10 temporary hit points at the start of their turns.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Power Word Stun",
        "Spell Level":"8th",
        "Spell Name":"Power Word Sun",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a blazing ball of plasma in a 10 foot by 10 foot sphere at a point you can see in range for one round. All creatures that can see the ball must make a Dexterity saving throw to shield their eyes. On a failure the target is blinded permanently until they are healed with a Greater Restoration spell or a Paladin's Restoring Touch feature. \n\n This miniature sun burns incredibly hot. Any creatures within 10 feet of it must also make a Constitution saving throw. On a failure they take 8d6 fire damage, or half as much damage on a successful one. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Antimagic Field",
        "Spell Level":"8th",
        "Spell Name":"Pro-magic Field",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" A 10-foot-radius invisible sphere of pro-magic surrounds you. This area is embued with excessive amounts of the magical energy that suffuses the multiverse. Within the sphere, spells are amplified, summoned creatures become more powerful, and magic items are enhanced. Until the spell ends, the sphere moves with you, centered on you. You can end the effects of Pro-agic Sphere as a bonus action.\n\n Any Magic actions you take or that pass through the sphere have advantage to hit, and deal additional damage equal to the level of spell cast.\n\n Any Magic actions you take from within the sphere that cause a creature to make a saving throw cause the creature to roll with disadvantage. In addition, you and any creatures within range of a spell centered at a point in the sphere make their spell save DC rolls with disadvantage.\n\n Any creature or spirit summoned with a spell within the sphere gains additional AC equal to ts spell level and deals additional damage on its attacks equal to the spell level used to summon it. \n\n Any magic items you wield or that pass through the sphere deal +4 damage. Any magic items you use from within the sphere or that other creatures use targeting creatures in the sphere follow the same rules mentioned above if they cause a spell to be cast.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Telepathy",
        "Spell Level":"8th",
        "Spell Name":"Therapy",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Choose a creature within range. You immediately end any fear and charm effects on the creature, give the target resistance to psychic damage, and make them immune to those effects for 24 hours. \n\n Roll 8d6. The target gains that many temporary hit points.\n\n You immediately gain ¼ of the target's current gold (rounding up) as compensation for your services. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Prismatic Wall",
        "Spell Level":"9th",
        "Spell Name":"Aesthmatic Wall",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" A solid wall--up to 90 feet long, 30 feet high, and 1 inch thick--centered on a point you can see within range. that sheds dust and other airborne allergies springs into existence.\n\n If a creature with allergies ever starts or ends its turn within 10 feet of the wall they immediately are blinded and are affected by the poisoned condition until they leave the area.\n\n If a creature without allergies ever starts its turn or ends its turn by the wall they must make a Constitution saving throw. On a failure the copious amount of shedding allergens is still irritating and they become poisoned until they leave the area. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Gate",
        "Spell Level":"9th",
        "Spell Name":"Bake",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"8 hours",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create up to 100 pounds of fresh baked goods in an area of your choosing you can see within range. If you create the baked goods in the air, they crash downwards causing all creatures in a 10 foot by 10 foot square to make a Dexterity saving throw. On a failure the creatures take 10d6 bludgeoning damage, are knocked prone and are restrained. On a success they take half damage. A creature trapped by the spell can attempt a Strength saving throw ending the prone and restrained conditions on a success.\n\n The bread is infused with miraculous magic. If a creature spends and action eating a loaf it immediatly gains 2d10 + 30 hitpoints and is cured of any conditions and medical conditions. However it is even more deadly to creatures with celiac disease, causing creatures with that condition 2d10 + 30 necrotic damage.\n\n The bread maintains its magical properties for 8 hours after being conjured.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Weird",
        "Spell Level":"9th",
        "Spell Name":"Beard",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a 30 foot radius sphere within 120 feet that you can see where creatures of your choice grow magical beards. \n\n The beards are indestructible and can be used as appendages. In addition they grant a creature an extra attack each turn. If the beard hits a target it automatically grapples it. A creature grappled can only escape a spell or ability that allows them to teleport or become incorporeal. The attack counts as a melee spell attack that uses your spell attack modifier and deals 3d10 bludgeoning damage. \n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Blade of Disaster",
        "Spell Level":"9th",
        "Spell Name":"Blade of Soft Plaster ",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a blade shaped clump of soft plaster about 3 feet long in an unoccupied space within range. The blade lasts for the duration. When you cast this spell, you can make up to two melee spell attacks with the blade, each one against a creature, loose object, or structure within 5 feet of the blade. On a hit, the target takes 4d4 force damage, and covers the target in rapidly hardening plaster \n\n When hit by the blade a target must make a Strength saving throw against your spell save DC to resist the hardening plaster. One failure they are restrained. The creature can make a Strength saving throw at the end of its turns to end the condition.\n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Astral Projection",
        "Spell Level":"9th",
        "Spell Name":"Emotional Projection",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a magical projector at a point you can see within range that begins to play a dramatic and emotional movie on a surface in a direction of your choosing. Any creature looking into the projector must make a Dexterity save or be blinded until their next turn.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Wish",
        "Spell Level":"9th",
        "Spell Name":"Fish",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"Fish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires, as long as those desires involve fish.\n\nThe basic use of this spell is to duplicate any other spell of 8th level or lower except it will also involve fish. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect.\n\nAlternatively, you can create one of the following effects of your choice:\nYou create one fish of up to 25,000 gp in value that isn't a magic item. The fish can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground.\nYou allow up to twenty creatures that you can see to regain all hit points, polymorph into fish, and you end all effects on them described in the greater restoration spell.\n\n\n You might be able to achieve something beyond the scope of the above examples. State your fish wish to the GM as precisely as possible. The fish wish must include or incorporate fish. If you choose to make a fish wish, The Golden Koi appears and does its best to fulfill your fish wish as literally as possible",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Imprisonment",
        "Spell Level":"9th",
        "Spell Name":"Imprison Me",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a 10 ft magical cage that surrounds you for the duration. It has a small bed, and the bars are invulnerable to damage. The cage cannot be moved from its spot. You can make spell attacks out of the cage as normal and ranged attacks out of the cage with disadvantage.\n\n While in the cage your AC increases by +5 and you automatically fail any Dexterity saving throws. Weapon attacks that cannot strike through the bars (e.g. a claw or large rock) cannot deal damage to you. You can use teleportation magic to escape, but doing so conjures a Deva that does its best to return you to the cage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Invulnerability",
        "Spell Level":"9th",
        "Spell Name":"Invulnerability Ability",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"You gain the ability to become invulnerable to all damage until the end of your next turn. Using this ability requires an action. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Mass Polymorph",
        "Spell Level":"9th",
        "Spell Name":"Mass Polygraph",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" For the duration of the spell you immediately discern whether any creature within 120 feet is lying for the duration of the spell. \n\n In addition you learn the truth immediately when a creature lies within 120 feet of you for the duration of the spell. If a creature lies to you while within the area of the spell they must make a Wisdom saving throw. On a failure they take 8d6 psychic damage, and on a success half damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Meteor Swarm",
        "Spell Level":"9th",
        "Spell Name":"Meatier Swarm",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You summon a rain of high quality cooked steaks at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a Dexterity saving throw. A creature takes 6d6 bludgeoning damage on a failed save, or half as much damage on a successful one.\n\n If a creature eats one of the steaks on their turn using an action they gain 10d6 hitpoints. A creature can only gain hit points from steaks created by this spell way once until they finish a long rest.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Power Word Kill",
        "Spell Level":"9th",
        "Spell Name":"Power Word Shrill",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" For the next round your voice becomes incredibly grating and high pitched. Whenever you speak you kill any dogs or cats that can hear you. \r\n\r\n Other creatures must make a Constitution saving throw or take 6d6 psychic damage on a failure, or half damage on a success. \r",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Psychic Scream",
        "Spell Level":"9th",
        "Spell Name":"Psychic Steam",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"10 minutes",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You create a relaxing and calming steam in a 60 foot sphere that lets you delve deeply into the minds of creatures in it. \n\n You immediately can read the thoughts of all creatures in the steam, and gain advantage on Charisma checks when interacting with anyone in the steam. By spending an action you can delve deeper into a targets psyche to discover their secrets. If you chose to do so the target must make a Wisdom saving throw with disadvantage to try and resist you.\n\n Additionally the steam is opaque and blocks line of sight until blown away by wind or a wind spell.\n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Time Stop",
        "Spell Level":"9th",
        "Spell Name":"Time Skip",
        "Components":null,
        "Casting Time":"Reaction",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You skip forward in time. Roll 1d4+1. You blink out of existence and reappear in the initiative order after a number of creatures equal to your roll have finished their turns.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"True Polymorph",
        "Spell Level":"9th",
        "Spell Name":"True Partial Polymorph",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" Choose one creature or non magical object that you can see within range. You transform the creature or object  into a combined chimera. Choose a different type of creature, or non magical object. If you combine a creature with another creature type it gains all the abilities of whatever creature you combined it with. If you choose an object, it gains all the abilities that object would grant. \r\n\r\n You can choose the arrangement or appearance of the creature but the creature must be a perfect 50\/50 split between its original form and the creature type or object chosen when the spell is cast.\r\n\r\n  The spell lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the spell lasts until it is dispelled.\r\n\r\nThis spell has no effect on a shapechanger or a creature with 0 hit points. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn’t affected by this spell.\r",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Shapechange",
        "Spell Level":"9th",
        "Spell Name":"Weightchange",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You gain the ability to alter the weight of either yourself or a creature you can see as a bonus action for the duration of the spell. If you choose a target other than yourself the target can attempt to resist the spell with a successful Intelligence saving throw. You make the weight change visually apparent by increasing the size or body composition of the affected creature. You can only reduce a target's weight by half or increase a target's weight to double their current weight.\n\n You can choose the visual appearance of this change, but you cannot add additional muscle to your body, only add or remove fat. If the target is wearing clothes, increasing the target's weight will rip them, and reducing the target's weight will cause their pants to fall down to their ankles.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Prestidigitation",
        "Spell Level":"Cantrip",
        "Spell Name":"Agitation",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You target a creature and befuddle its mind with rage.\n\nThe target must make a Wisdom saving throw. On a success they repel the attempt to antagonize them. On a failure the target gains disadvantage on melee, ranged or spell attacks and deals an additional d6 damage on melee attacks.\n\nAt the end of their turn the target can attempt the save again, ending the spell's effects on a success.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Blade Ward",
        "Spell Level":"Cantrip",
        "Spell Name":"Bard Ward",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You extend your hand and trace a sigil of warding in the air. Until the end of your next turn you have resistance against spells that require somatic components.\n\n In addition if a bard is in the area they must make a Charisma saving throw equal to your spell save DC in order to speak to you while the spell is active.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Chill Touch",
        "Spell Level":"Cantrip",
        "Spell Name":"Chilli Touch",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You create a ghostly bowl of chili that moves towards a target. Make a spell attack roll. On a hit the target is doused in scalding chili dealing 1d6 fire damage. Any creature within 5 feet of the creature must make a Dexterity saving throw. On a failure they also take damage equal to half the damage dealt to the creature targeted, as errant drops of boiling chili splatter onto them.\n\nThis spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Control Flame",
        "Spell Level":"Cantrip",
        "Spell Name":"Control Phlegm",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You choose a non magical nose that you can see within range on a living creature of medium size or smaller. Alternatively you can control phlegm outside of a nostril  the size of your palm. You affect it in one of  the following ways:\n\nYou instantaneously pull out the phlegm from the nostril 5 feet in one direction.\nYou instantaneously dry the phlegm or make it runny. The affected phlegm cannot be returned to normal by non magical means or until the spell ends.\nYou double or halve the amount of phlegm targeted, and can change its color.\nYou can shape phlegm into shapes, or words and animate it as you like. The shapes or words last for 1 hour.\n\nIf you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Frostbite",
        "Spell Level":"Cantrip",
        "Spell Name":"Dog Bite",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You conjure a dog that rushes forward to attack a creature in range. If the conjured dog cannot reach the target it barks angrily before disappearing and the spell has no affect.\n\n Make a ranged spell attack against the target. On a hit roll a d4 and consult the following table to determine the breed of dog conjured and the damage dealt.\n\n1d4 - Chihuahua\n1d6 - Corgi\n1d8 - German Shepherd\n1d10 - Pitbull\n\nThis spell's damage increases when you reach 5th level (2d4\/2d6\/2d8\/2d10), 11th level (3d4\/3d6\/3d8\/3d10), and 17th level (4d4\/4d6\/4d8\/4d10).",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Encode Thoughts",
        "Spell Level":"Cantrip",
        "Spell Name":"Encode Bats",
        "Components":"Bat",
        "Casting Time":"Action",
        "Duration":"8 hours",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" Putting a finger to your head, you pull a memory, an idea, or a message from your mind. You then touch a bat and store it inside it. \n\n If you cast this spell while concentrating on a spell or an ability that allows you to read or manipulate the thoughts of others (such as detect thoughts or modify memory), you can transfer the thoughts or memories you read, rather than your own, into a bat.\n\nCasting this spell while holding a bat already encoded with information allows you to instantly receive whatever memory, idea, or message the bat  contains. (Casting detect thoughts on the bat has the same effect.)",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Friends",
        "Spell Level":"Cantrip",
        "Spell Name":"Fiends",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You summon a group of three imps in a space adjacent to you. These fiends claim to be your friends, and offer to do your bidding for the next minute. They take orders literally and won’t hesitate to act in a fiendish manner when they can, aiming to cause as much chaos as possible.\n\n The imps use the Imp stat block.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Dancing Lights",
        "Spell Level":"Cantrip",
        "Spell Name":"Financing Lights",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 hour",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You create torch sized lights in an area, making them appear as torches, lanterns or glowing orbs that hover in the area for the duration. Each light sheds dim light in a 10 foot radius. They follow orders telepathically without the need for concentration.\n\n You can create as many lights as you would like, but each light costs you one gold piece. \n\n For 5 gold pieces you can combine the lights you create into one glowing vaguely humanoid form of Medium size that follows your orders. This does not increase the brightness of the lights.\n\n As a bonus action, you can join the premium plan and pay 5 gold to be able to move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell’s range. You can ignore this restriction if you buy our super premium package for another 10 gold pieces.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Fire Bolt",
        "Spell Level":"Cantrip",
        "Spell Name":"Flyer Bolt",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You conjure and hurl a heavy stack of flyers at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d4 bludgeoning damage. If the flyers pass through fire, or water the attack is dissipated and has no effect.\n\nThe flyers in question are always advertising an item the target desires. At the start of their turn they must make a Wisdom Saving throw against your spell save DC. On a failure the target is distracted and has disadvantage on the next attack they make.\n\nThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Lightning Lure",
        "Spell Level":"Cantrip",
        "Spell Name":"Lightning Purr",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"Your body builds up electrical energy and stores it. The next time you are pet on the head or rub your body on a surface you purr loudly and create a lash of lightning energy that strikes at one creature of your choice that you can see within 15 feet of you. The target must succeed on a Dexterity saving throw or suffer 1d8 lightning damage. \n\nThis spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Message",
        "Spell Level":"Cantrip",
        "Spell Name":"Massage",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You target a creature within range that you can see. They immediately receive a wonderful massage with spectral hands. \n\n The target gains 1d10 temporary hit points and advantage on the next skill check that requires Strength or Dexterity.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Ray of Frost",
        "Spell Level":"Cantrip",
        "Spell Name":"Ray of Toast",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":" You conjure magical floating metal heating elements opposite each other that pulse with heat and toast a creature of your choice within range. The conjured floating elements last for 1 minute or until you end concentration on the spell. They only produce heat in the direction of each other.\n\n The target must make a Constitution saving throw when it enters the affected area for the first time or if it ends its turn there. On a failure they take 1d6 fire damage and smell of toasted bread for the next hour. On a success, they take half damage and smell of toasted bread for 1 minute. If any creature touches the floating heating elements they must also make the same Constitution saving throw.\n\nThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\n",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Booming Blade",
        "Spell Level":"Cantrip",
        "Spell Name":"Shrooming Blade",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"Your blade erupts in multicolored magic mushrooms. The mushrooms dull the blade, causing your next attack to deal half damage. However their exploding spores cause the target to make a Constitution saving throw. On a failure they take 1d6 poison damage and are poisoned. On a success they take half damage.\n\nThe creatures affected can attempt the Constitution save again at the end of their turns, ending the poisoned condition on a success.\n\nThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Light",
        "Spell Level":"Cantrip",
        "Spell Name":"Smite",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You create a bright light that rushes towards whatever creature most recently performed certain actions, excluding yourself. These include:\n1. Stealing\n2. Adultery\n3. Murder\n4. Lieing \n\n If multiple creatures fulfill at least one of these criteria, the light targets all of them. Once a creature has been struck by Smite, they are immune to the spell until they perform one of the above acts again.\n\n The target must then make a Wisdom saving throw against your spell save DC. On a  failure they take 3d8 radiant damage, and on a success half damage.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Mage Hand",
        "Spell Level":"Cantrip",
        "Spell Name":"Stage Hand",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":"You summon a construct assistant wearing a black turtleneck who tries its best to perform a simple task given to it. The construct uses the casters spell casting modifier when performing skill checks and has advantage on any task it has been given if that task could also be given while working as a stagehand for a theatrical production.\n\nThe assistant has a speed of 30 ft, an AC of 10 and 10 HP.",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Sword Burst",
        "Spell Level":"Cantrip",
        "Spell Name":"Sword Curse",
        "Components":null,
        "Casting Time":"Action",
        "Duration":"1 minute",
        "Requires Concentration?":"Yes",
        "Range":null,
        "Description":"You choose a non magical weapon that you can see that can deal slashing, bludgeoning or piercing damage. The weapon becomes cursed temporarily for the next minute causing the weilder to be affected by horrendows bad luck. While a creature has the weapon on their person, your attacks and spells deal an extra 1d8 damage to the target and they reduce their attack rolls, skill checks and saving throws by 1d4. ",
        "Unnamed: 10":null
    },
    {
        "Rules Version":2024,
        "Base Spell":"Green-Flame Blade",
        "Spell Level":"Cantrip",
        "Spell Name":"Virgin-Flame Blade",
        "Components":null,
        "Casting Time":"Bonus Action",
        "Duration":"Instantaneous",
        "Requires Concentration?":"No",
        "Range":null,
        "Description":" You brandish the weapon used in the spell’s casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack’s normal effects, and you can cause flames  to leap from the target to a different creature of your choice that you can see within 5 feet of it who is not a virgin.  The second creature takes fire damage equal to your spellcasting ability modifier.\n\n If you are a virgin and you use this spell the melee attack deals an extra 1d8 fire damage to the target on a hit, and the fire damage to the second creature increases to 1d8 + your spellcasting ability modifier. If you are not a virgin and you cast this spell you take 1d8 fire damage. All damage rolls, including the damage the spell deals to non-virgins casting the spell,  increase by 1d8 at 11th level (2d8 and 2d8) and 17th level (3d8 and 3d8).",
        "Unnamed: 10":null
    }
]